Repository: fxanhkhoa/what-to-eat-angular
Catalog: src/locale/messages.*.xlf
Languages: vi

source: No Data
vi: Không có dữ liệu

source: Share your feedback
vi: Chia sẻ phản hồi của bạn

source: Share Your Experience
vi: Chia sẻ trải nghiệm của bạn

source: Close dialog
vi: Đóng hộp thoại

source: We'd love to hear your thoughts! Your feedback helps us improve.
vi: Chúng tôi rất muốn nghe suy nghĩ của bạn! Phản hồi của bạn giúp chúng tôi cải thiện.

source: How would you rate your experience? *
vi: Bạn đánh giá trải nghiệm của mình thế nào? *

source: Please select a rating
vi: Vui lòng chọn xếp hạng

source: Your Name
vi: Tên của bạn

source: Email Address
vi: Địa chỉ email

source: Email is required
vi: Email là bắt buộc

source: Please enter a valid email
vi: Vui lòng nhập email hợp lệ

source: Your Feedback
vi: Phản hồi của bạn

source: Tell us what you think...
vi: Hãy cho chúng tôi biết suy nghĩ của bạn...

source: Feedback comment is required
vi: Bình luận phản hồi là bắt buộc

source: Please provide at least 10 characters
vi: Vui lòng cung cấp ít nhất 10 ký tự

source: Cancel
vi: Hủy

source: Submitting...
vi: Đang gửi...

source: Submit Feedback
vi: Gửi phản hồi

source: success
vi: thành công

source: Thank you for your feedback! 🎉
vi: Cảm ơn phản hồi của bạn! 🎉

source: error
vi: lỗi

source: Contact Management
vi: Quản lý liên hệ

source: Manage user contact submissions
vi: Quản lý các liên hệ được gửi bởi người dùng

source: Refresh
vi: Làm mới

source: Total Contacts
vi: Tổng số liên hệ

source: Active Contacts
vi: Liên hệ đang hoạt động

source: This Month
vi: Tháng này

source: Search contacts
vi: Tìm kiếm liên hệ

source: Search by name, email, or message...
vi: Tìm kiếm theo tên, email hoặc tin nhắn...

source: Clear
vi: Xóa

source: Loading contacts...
vi: Đang tải liên hệ...

source: No contacts found
vi: Không tìm thấy liên hệ nào

source: There are no contact submissions yet.
vi: Chưa có liên hệ nào được gửi.

source: Name
vi: Tên

source: Deleted
vi: Đã xóa

source: Contact
vi: Liên hệ

source: Message
vi: Tin nhắn

source: Submitted
vi: Đã gửi

source: Date
vi: Ngày

source: Actions
vi: Thao tác

source: View full details
vi: Xem chi tiết

source: Delete contact
vi: Xóa liên hệ

source: Select page of contacts
vi: Chọn trang liên hệ

source: Contact Details
vi: Chi tiết liên hệ

source: Last Updated
vi: Cập nhật lần cuối

source: Status
vi: Trạng thái

source: Close
vi: Đóng

source: Dish Management
vi: Quản lý món ăn

source: Manage your recipe collection with enhanced search capabilities
vi: Quản lý bộ sưu tập công thức của bạn với khả năng tìm kiếm nâng cao

source: Create New Dish
vi: Tạo món ăn mới

source: Search dishes...
vi: Tìm món ăn...

source: Try 'spicy chicken' or 'vegetarian pasta'
vi: Thử 'gà cay' hoặc 'mì ống chay'

source: Quick search:
vi: Tìm kiếm nhanh:

source: Search mode:
vi: Chế độ tìm kiếm:

source: Enhanced
vi: Nâng cao

source: Basic
vi: Cơ bản

source: {{isFilterExpanded ? 'Hide' : 'Show'}} Filters
vi: {{isFilterExpanded ? 'Hide' : 'Show'}}Bộ lọc

source: Advanced Filters
vi: Bộ lọc nâng cao

source: Refine your search with detailed criteria
vi: Tinh chỉnh tìm kiếm với các tiêu chí chi tiết

source: Tags & Keywords
vi: Thẻ & Từ khóa

source: Tags
vi: Thẻ

source: Add tags like 'spicy', 'vegetarian'...
vi: Thêm thẻ như 'cay', 'ăn chay'...

source: Press Enter or comma to add tags
vi: Nhấn Enter hoặc dấu phẩy để thêm thẻ

source: Difficulty & Categories
vi: Độ khó & Danh mục

source: Meal Categories
vi: Danh mục bữa ăn

source: Cooking Time Filters
vi: Bộ lọc thời gian nấu

source: in minute
vi: theo phút

source: Preparation Time
vi: Thời gian chuẩn bị

source: Cooking Time
vi: Thời gian nấu

source: Ingredients & Labels
vi: Nguyên liệu & Nhãn

source: Ingredient Categories
vi: Danh mục nguyên liệu

source: Specific Ingredients
vi: Nguyên liệu cụ thể

source: e.g., chicken, tomato, basil...
vi: VD: thịt gà, cà chua, húng quế...

source: Labels
vi: Nhãn

source: e.g., gluten-free, low-carb...
vi: VD: không gluten, ít carb...

source: Showing {{totalResults()}} results
vi: Hiển thị{{totalResults()}}kết quả

source: Clear All
vi: Xóa tất cả

source: Apply Filters
vi: Áp dụng bộ lọc

source: Search Results
vi: Kết quả tìm kiếm

source: Found
vi: Tìm thấy

source: dishes
vi: món ăn

source: Enhanced Search
vi: Tìm kiếm nâng cao

source: No dishes found. Try adjusting your search criteria.
vi: Không tìm thấy món ăn nào. Hãy thử điều chỉnh tiêu chí tìm kiếm của bạn.

source: Searching for dishes...
vi: Đang tìm kiếm món ăn...

source: Edit dish
vi: Sửa món ăn

source: Delete dish
vi: Xóa món ăn

source: Image
vi: Ảnh

source: Dish Details
vi: Chi tiết món ăn

source: Time Info
vi: Thông tin thời gian

source: Prep:
vi: Chuẩn bị:

source: min
vi: phút

source: Cook:
vi: Nấu:

source: Total: {{dish.preparationTime + dish.cookingTime}} min
vi: Tổng cộng:{{dish.preparationTime + dish.cookingTime}}phút

source: Categories
vi: Danh mục

source: No dishes found
vi: Không tìm thấy món ăn nào

source: Try adjusting your search criteria or clearing filters
vi: Hãy thử điều chỉnh tiêu chí tìm kiếm hoặc xóa bộ lọc.

source: Clear Search
vi: Xóa tìm kiếm

source: Showing {{ (paginator.pageIndex * paginator.pageSize) + 1 }} to {{ Math.min((paginator.pageIndex + 1) * paginator.pageSize, totalResults()) }} of {{ totalResults() }} results
vi: Hiển thị{{ (paginator.pageIndex * paginator.pageSize) + 1 }}đến{{ Math.min((paginator.pageIndex + 1) * paginator.pageSize, totalResults()) }} của{{ totalResults() }}kết quả

source: Page
vi: Trang

source: Jump to page
vi: Chuyển đến trang

source: Delete Dish
vi: Xóa món ăn

source: Are you sure you want to delete "dish.title.find((t) => t.lang === this.localeId)!.data"?
vi: Bạn có chắc chắn muốn xóa "dish.title.find((t) => t.lang === this.localeId)!.data"?

source: Ingredient deleted successfully
vi: Đã xóa nguyên liệu thành công.

source: dish-name-slug
vi: ten-mon-an-slug

source: Slug is required
vi: Slug là bắt buộc

source: Thumbnail URL
vi: URL hình thu nhỏ

source: Preview image
vi: Xem trước hình ảnh

source: Thumbnail Preview
vi: Xem trước hình thu nhỏ

source: Title Translations
vi: Bản dịch tiêu đề

source: Add Language
vi: Thêm ngôn ngữ

source: Click the button above to add another language field to all translation sections.
vi: Nhấp vào nút trên để thêm trường ngôn ngữ khác vào tất cả các phần dịch.

source: Language
vi: Ngôn ngữ

source: Title
vi: Tiêu đề

source: Dish Title
vi: Tiêu đề món ăn

source: Remove language
vi: Xóa ngôn ngữ

source: Short Description Translations
vi: Bản dịch mô tả ngắn

source: Short Description
vi: Mô tả ngắn

source: Brief description of the dish
vi: Mô tả ngắn gọn về món ăn

source: Content Translations
vi: Bản dịch nội dung

source: Preparation Time (minutes)
vi: Thời gian chuẩn bị (phút)

source: Cooking Time (minutes)
vi: Thời gian nấu (phút)

source: Difficulty Level
vi: Mức độ khó

source: -- Select Difficulty --
vi: -- Chọn độ khó --

source: New tag...
vi: Thẻ mới...

source: New label...
vi: Nhãn mới...

source: Videos
vi: Video

source: Add Video
vi: Thêm video

source: Video URL
vi: URL video

source: Preview video
vi: Xem trước video

source: Remove video
vi: Xóa video

source: Ingredients
vi: Nguyên liệu

source: Quantity
vi: Số lượng

source: Quantity is required
vi: Cần có số lượng

source: Ingredient
vi: Nguyên liệu

source: Search ingredient...
vi: Tìm nguyên liệu...

source: Note
vi: Ghi chú

source: Update Dish
vi: Cập nhật món ăn

source: Create Dish
vi: Tạo món ăn

source: Updated
vi: Đã cập nhật

source: Dish res.title.find((e) => e.lang === this.localeId)?.data ' ' updated successfully
vi: Món ănres.title.find((e) => e.lang === this.localeId)?.data ' 'cập nhật thành công

source: Created
vi: Đã tạo

source: Dish res.title.find((e) => e.lang === this.localeId)?.data created successfully
vi: Món ănres.title.find((e) => e.lang === this.localeId)?.datatạo thành công

source: Create
vi: Tạo

source: Ingredient updated successfully
vi: Nguyên liệu cập nhật thành công

source: Ingredient created successfully
vi: Nguyên liệu tạo thành công

source: Basic Information
vi: Thông tin cơ bản

source: Enter role permission name
vi: Nhập tên quyền vai trò

source: Name is required
vi: Tên không được để trống

source: Name must be at least 3 characters
vi: Tên phải có ít nhất 3 ký tự

source: Description
vi: Mô tả

source: Enter description (optional)
vi: Nhập mô tả (không bắt buộc)

source: Permissions
vi: Quyền

source: Drag permissions from available list to selected list
vi: Kéo quyền từ danh sách khả dụng sang danh sách đã chọn

source: Available Permissions
vi: Quyền khả dụng

source: All permissions have been assigned
vi: Đã gán tất cả quyền

source: Remove permission
vi: Xóa quyền

source: Drag permissions here
vi: Kéo quyền vào đây

source: Role Permissions
vi: Quyền vai trò

source: Add Role Permission
vi: Thêm quyền vai trò

source: Search
vi: Tìm kiếm

source: Search by name
vi: Tìm kiếm theo tên

source: permissions
vi: quyền

source: Click to view details
vi: Nhấp để xem chi tiết

source: No permissions assigned
vi: Chưa có quyền nào được gán

source: Edit
vi: Chỉnh sửa

source: Delete
vi: Xóa

source: Enter email address
vi: Nhập địa chỉ email

source: Enter full name
vi: Nhập họ và tên

source: Name must be at least 2 characters
vi: Tên phải có ít nhất 2 ký tự

source: Phone
vi: Điện thoại

source: Enter phone number
vi: Nhập số điện thoại

source: Role
vi: Vai trò

source: Loading roles...
vi: Đang tải vai trò...

source: Role is required
vi: Vai trò là bắt buộc

source: Date of Birth
vi: Ngày sinh

source: Address
vi: Địa chỉ

source: Enter address
vi: Nhập địa chỉ

source: Users
vi: Người dùng

source: Add User
vi: Thêm người dùng

source: Search by name, email, or phone
vi: Tìm kiếm theo tên, email hoặc số điện thoại

source: Created At
vi: Ngày tạo

source: No users found
vi: Không tìm thấy người dùng nào

source: Go to Client
vi: Đi đến khách hàng

source: Dashboard
vi: Bảng điều khiển

source: Dish
vi: Món ăn

source: Feedback
vi: Phản hồi

source: Role Permission
vi: Quyền vai trò

source: User Management
vi: Quản lý người dùng

source: Logout
vi: Đăng xuất

source: Toggle sidenav
vi: Chuyển đổi thanh điều hướng bên

source: Side nav toggle icon
vi: Biểu tượng bật/tắt menu phụ

source: Change language
vi: Đổi ngôn ngữ

source: Failed
vi: Thất bại

source: Can not log out
vi: Không thể đăng xuất

source: Total Dishes
vi: Tổng số món ăn

source: Total Ingredients
vi: Tổng số nguyên liệu

source: Admin Dashboard
vi: Bảng điều khiển quản trị

source: Role Name
vi: Tên vai trò

source: Customer Feedback
vi: Phản hồi khách hàng

source: View and manage customer feedback submissions
vi: Xem và quản lý phản hồi của khách hàng

source: Filter by Email
vi: Lọc theo Email

source: Search by email...
vi: Tìm kiếm theo email...

source: Filter by Rating
vi: Lọc theo Đánh giá

source: All Ratings
vi: Tất cả đánh giá

source: 5 Stars
vi: 5 sao

source: 4 Stars
vi: 4 sao

source: 3 Stars
vi: 3 sao

source: 2 Stars
vi: 2 sao

source: 1 Star
vi: 1 Sao

source: Reset
vi: Đặt lại

source: Loading feedbacks...
vi: Đang tải phản hồi...

source: View Details
vi: Xem chi tiết

source: Delete feedback
vi: Xóa phản hồi

source: No feedback found
vi: Không tìm thấy phản hồi nào

source: Try adjusting your filters
vi: Hãy thử điều chỉnh bộ lọc của bạn

source: No feedback submissions yet
vi: Chưa có phản hồi nào được gửi

source: Home
vi: Trang chủ

source: Admin
vi: Quản trị

source: Game
vi: Trò chơi

source: Food Wheel
vi: Vòng quay món ăn

source: Food Flip
vi: Lật món ăn

source: Food Voting
vi: Bình chọn món ăn

source: Profile
vi: Hồ sơ

source: Login
vi: Đăng nhập

source: Discover delicious recipes and meal ideas tailored to your preferences and dietary needs.
vi: Khám phá các công thức nấu ăn ngon và ý tưởng bữa ăn phù hợp với sở thích và nhu cầu ăn kiêng của bạn.

source: Quick Links
vi: Liên kết nhanh

source: Home
vi: Trang chủ

source: All Dishes
vi: Tất cả món ăn

source: About Us
vi: Về chúng tôi

source: Stay Updated
vi: Luôn cập nhật

source: Subscribe to our newsletter for the latest recipes and tips.
vi: Đăng ký nhận bản tin của chúng tôi để nhận công thức và mẹo mới nhất.

source: Your email
vi: Email của bạn

source: Subscribe
vi: Đăng ký

source: Privacy Policy
vi: Chính sách quyền riêng tư

source: Terms of Service
vi: Điều khoản dịch vụ

source: Cookie Policy
vi: Chính sách Cookie

source: Back
vi: Quay lại

source: Filter
vi: Lọc

source: Let's find your favorite dishes!
vi: Cùng tìm món ăn yêu thích của bạn!

source: The Ultimate Food Guide: What to Eat Now
vi: Hướng dẫn ẩm thực tối ưu: Ăn gì bây giờ

source: Hungry? Discover delicious dishes, restaurant recommendations, and food guides for every craving. Find your next meal!
vi: Bạn đói à? Khám phá các món ăn ngon, gợi ý nhà hàng và hướng dẫn ẩm thực cho mọi cơn thèm. Tìm bữa ăn tiếp theo của bạn!

source: WINNER
vi: NGƯỜI CHIẾN THẮNG

source: Preparation
vi: Chuẩn bị

source: Minutes
vi: Phút

source: Discover
vi: Khám phá

source: Discover Recipe
vi: Khám Phá Công Thức

source: No video available
vi: Không có video

source: This dish doesn't have any video tutorials yet
vi: Món này chưa có video hướng dẫn

source: ingredients
vi: nguyên liệu

source: Copy
vi: Sao chép

source: Mail
vi: Thư

source: Copy Link
vi: Sao chép liên kết

source: Related Dishes
vi: Món ăn liên quan

source: Copied!
vi: Đã sao chép!

source: Filter
vi: Lọc

source: Card Deck
vi: Bộ thẻ

source: Shuffle Deck
vi: Tráo bộ thẻ

source: Pick a dish
vi: Chọn một món

source: Add
vi: Thêm

source: Success
vi: Thành công

source: Dish added!
vi: Đã thêm món ăn!

source: Flipping Card Game
vi: Trò chơi lật bài

source: Voting Chat
vi: Trò chuyện bình chọn

source: Reconnect
vi: Kết nối lại

source: Load earlier messages
vi: Tải tin nhắn cũ hơn

source: Add reaction
vi: Thêm biểu cảm

source: No messages yet. Start the conversation!
vi: Chưa có tin nhắn nào. Hãy bắt đầu cuộc trò chuyện!

source: Online ({{ onlineCount() }})
vi: Trực tuyến ({{ onlineCount() }})

source: Type a message...
vi: Nhập tin nhắn...

source: Send message (Enter)
vi: Gửi tin nhắn (Enter)

# voting-chat.someone
source: Someone
vi: Ai đó

# voting-chat.one-typing
source: names[0] is typing...
vi: names[0] đang nhập...

# voting-chat.two-typing
source: names[0] and names[1] are typing...
vi: names[0] và names[1] đang nhập...

# voting-chat.multiple-typing
source: names.length people are typing...
vi: names.length người đang nhập...

# voting-chat.no-one-online
source: No one online
vi: Không có ai trực tuyến

# voting-chat.one-person-online
source: 1 person online
vi: 1 người trực tuyến

# voting-chat.multiple-people-online
source: count people online
vi: count người trực tuyến

source: Add Custom Dish
vi: Thêm món ăn tùy chỉnh

source: Create a custom dish for voting
vi: Tạo món ăn tùy chỉnh để bình chọn

source: Enter dish URL
vi: Nhập URL món ăn

source: Reference link to dish
vi: Liên kết tham khảo đến món ăn

source: Create Voting
vi: Tạo bình chọn

source: Voting Dishes
vi: Món ăn bình chọn

source: Dishes included in the voting
vi: Các món ăn trong bình chọn

source: Clear all selected dishes
vi: Xóa tất cả món đã chọn

source: Add custom dish
vi: Thêm món ăn tùy chỉnh

source: Custom Dishes
vi: Món ăn tùy chỉnh

source: Voting Details
vi: Chi tiết bình chọn

source: Duplicated
vi: Trùng lặp

source: This custom dish already exists.
vi: Món ăn tùy chỉnh này đã tồn tại.

source: Share Voting Session
vi: Chia sẻ phiên bình chọn

source: Open in new tab
vi: Mở trong tab mới

source: Share on Facebook
vi: Chia sẻ trên Facebook

source: Share on X
vi: Chia sẻ trên X

source: Share on Telegram
vi: Chia sẻ trên Telegram

source: Voting Game List
vi: Danh sách trò chơi bình chọn

source: Search voting sessions...
vi: Tìm kiếm phiên bình chọn...

source: Create New Voting Session
vi: Tạo phiên bình chọn mới

source: Create Your First Voting Session
vi: Tạo phiên bình chọn đầu tiên của bạn

source: votes
vi: lượt bình chọn

source: Winner:
vi: Người chiến thắng:

source: Contains custom dishes
vi: Có món ăn tùy chỉnh

source: View
vi: Xem

source: More actions
vi: Thêm hành động

source: Open Session
vi: Mở phiên

source: Share
vi: Chia sẻ

source: Anonymous
vi: Nặc danh

source: Result
vi: Kết quả

source: Voted by:
vi: Được bình chọn bởi:

source: Remove Vote
vi: Xóa bình chọn

source: Vote Now!
vi: Bình chọn ngay!

source: Preview Dish
vi: Xem trước món ăn

source: Wheel of Fortune
vi: Vòng quay may mắn

source: Spin the wheel and see what you get!
vi: Quay vòng và xem bạn nhận được gì!

source: spin
vi: quay

source: Contact Us
vi: Liên hệ với chúng tôi

source: Name is required
vi: Tên không được để trống

source: Your message
vi: Tin nhắn của bạn

source: Message is required
vi: Tin nhắn không được để trống

source: Send Message
vi: Gửi tin nhắn

source: Get In Touch
vi: Liên lạc

source: Follow Us
vi: Theo dõi chúng tôi

source: Message sent successfully!
vi: Đã gửi tin nhắn thành công!

source: Filter By
vi: Lọc theo

source: Favorite Dishes
vi: Món ăn yêu thích

source: {{ item.preparationTime | number: '1.0-0' }} min
vi: {{ item.preparationTime | number: '1.0-0' }}phút

source: Hungry?
vi: Đói chưa?

source: Eat What
vi: Ăn Gì

source: Unlock a world of dining options and discover your next delicious meal, conveniently and wherever you are
vi: Khám phá thế giới ẩm thực phong phú và tìm món ngon tiếp theo, tiện lợi mọi lúc mọi nơi

source: 1000+ Dishes
vi: 1000+ Món Ăn

source: Top Rated
vi: Đánh Giá Cao

source: Quick & Easy
vi: Nhanh & Dễ

source: Find Your Meal
vi: Tìm Món Ăn

source: Try Games
vi: Chơi Game

source: Follow us:
vi: Theo dõi chúng tôi:

source: Recipes
vi: Công Thức

source: Rating
vi: Đánh Giá

source: Smart Search
vi: Tìm Kiếm Thông Minh

source: Find anything
vi: Tìm mọi thứ

source: Save Favorites
vi: Lưu Yêu Thích

source: Quick access
vi: Truy cập nhanh

source: Fun Games
vi: Trò Chơi Vui

source: Random picks
vi: Chọn ngẫu nhiên

source: AI Suggest
vi: AI Gợi Ý

source: Personalized
vi: Cá nhân hóa

source: Trusted by Thousands
vi: Được Hàng Nghìn Người Tin Dùng

source: Scroll to explore
vi: Cuộn để khám phá

source: Ingredients
vi: Nguyên liệu

# paginatorRangeLabel
source: startIndex + 1 - endIndex of length
vi: startIndex + 1 - endIndexcủalength

source: <mat-icon class="group-hover:scale-110 transition-transform">home</mat-icon><span>Home</span>
vi: <mat-icon class="group-hover:scale-110 transition-transform">home</mat-icon><span>Trang chủ</span>

source: <mat-icon class="group-hover:scale-110 transition-transform">restaurant</mat-icon><span>Dish</span>
vi: <mat-icon class="group-hover:scale-110 transition-transform">restaurant</mat-icon><span>Món ăn</span>

source: <mat-icon class="group-hover:scale-110 transition-transform">eco</mat-icon><span>Ingredient</span>
vi: <mat-icon class="group-hover:scale-110 transition-transform">eco</mat-icon><span>Nguyên liệu</span>

source: <mat-icon class="group-hover:scale-110 transition-transform">bookmark</mat-icon><span>My Dishes</span>
vi: <mat-icon class="group-hover:scale-110 transition-transform">bookmark</mat-icon><span>Món của tôi</span>

source: All Dishes
vi: Tất cả món ăn

source: About Us
vi: Về chúng tôi

source: Privacy Policy
vi: Chính sách bảo mật

source: Terms of Service
vi: Điều khoản dịch vụ

source: Cookie Policy
vi: Chính sách Cookie

source: <mat-icon class="group-hover:scale-110 transition-transform">admin_panel_settings</mat-icon><span>Admin</span>
vi: <mat-icon class="group-hover:scale-110 transition-transform">admin_panel_settings</mat-icon><span>Quản trị</span>

source: Filter By Category
vi: Lọc theo danh mục

source: Favorite Dishes
vi: Món ăn yêu thích

source: Discover culinary masterpieces
vi: Khám phá những kiệt tác ẩm thực

source: Let's pick your favorites to enlighten your day
vi: Hãy chọn món yêu thích để làm sáng ngày của bạn

source: Explore All Dishes
vi: Khám phá tất cả món ăn

source: Loading delicious dishes...
vi: Đang tải món ăn ngon...

source: Explore Now
vi: Khám phá ngay

source: Interactive Games
vi: Trò chơi tương tác

source: Play & Decide
vi: Chơi và quyết định

source: Can't decide what to eat? Let our fun games help you choose!
vi: Không quyết định được ăn gì? Hãy để trò chơi vui của chúng tôi giúp bạn chọn!

source: Game {{ i + 1 }} of {{ slides.length }}
vi: Trò chơi {{ i + 1 }} trong {{ slides.length }}

source: Play Now
vi: Chơi ngay

source: Learn More
vi: Tìm hiểu thêm

source: Quick Play
vi: Chơi nhanh

source: Fresh & Organic
vi: Tươi & hữu cơ

source: Discover Ingredients
vi: Khám phá nguyên liệu

source: Explore our collection of fresh, high-quality ingredients to create amazing dishes
vi: Khám phá bộ sưu tập nguyên liệu tươi ngon, chất lượng cao để tạo ra những món ăn tuyệt vời

source: Filter by Category
vi: Lọc theo danh mục

source: Clear All Filters
vi: Xóa tất cả bộ lọc

source: Loading fresh ingredients...
vi: Đang tải nguyên liệu tươi...

source: No Ingredients Found
vi: Không tìm thấy nguyên liệu

source: Try adjusting your filters to find more ingredients
vi: Thử điều chỉnh bộ lọc để tìm thêm nguyên liệu

source: Reset Filters
vi: Đặt lại bộ lọc

source: Scroll to see more
vi: Cuộn để xem thêm
